<h1>INTRODUCCIÓN A PANDAS<h1>

_First part_

<h3>Read CSV 5<h3>

In [1]:
#importando pandas para obtener la librería

import pandas as pd

In [5]:
#Leyendo un csv con pandas, colocampos la ruta y la leemos
#No se olviden de coloca el doble back slash en su directorio para que pueda leer bien la ruta

csv_path = 'C:\\Users\ilche_st130to\Downloads\Jupyter\datos.csv'
df= pd.read_csv(csv_path)
print(df)

     Nombre  Edad  Sueldo
0     Ilche    22    3000
1     aaron    21    2939
2     oscar    23    1078
3    alonso    25    2884
4   iriarte    22    2320
5   nicolas    23    1184
6    marcel    21    1382
7     dario    20    2977
8    mirian    19    1022
9     karla    19    1155
10    smail    22    1119

In [6]:
#DataFrame para colocar los datos 

csv_path = 'C:\\Users\ilche_st130to\Downloads\Jupyter\datos.csv'
df= pd.read_csv(csv_path)
df.head()

    Nombre  Edad  Sueldo
0    Ilche    22    3000
1    aaron    21    2939
2    oscar    23    1078
3   alonso    25    2884
4  iriarte    22    2320

<h3>Read Excel<h3>

In [13]:
#importando pandas para obtener la librería

import pandas as pd

In [14]:
#Leyendo un excel con pandas, colocampos la ruta y la leemos
#No se olviden de coloca el doble back slash en su directorio para que pueda leer bien la ruta

excel_path = 'C:\\Users\ilche_st130to\OneDrive\Escritorio\Jupyter\Datos2.xlsx'
df= pd.read_excel(excel_path)
print(df)

     Nombre  Edad  Sueldo
0     Ilche    22    3000
1     aaron    21    2939
2     oscar    23    1078
3    alonso    25    2884
4   iriarte    22    2320
5   nicolas    23    1184
6    marcel    21    1382
7     dario    20    2977
8    mirian    19    1022
9     karla    19    1155
10    smail    22    1119

In [18]:
#DataFrame para colocar los datos 

excel_path = 'C:\\Users\ilche_st130to\OneDrive\Escritorio\Jupyter\Datos2.xlsx'
df2= pd.read_excel(excel_path)
df2.head(11)

     Nombre  Edad  Sueldo
0     Ilche    22    3000
1     aaron    21    2939
2     oscar    23    1078
3    alonso    25    2884
4   iriarte    22    2320
5   nicolas    23    1184
6    marcel    21    1382
7     dario    20    2977
8    mirian    19    1022
9     karla    19    1155
10    smail    22    1119

<h3>CREANDO UN DATAFRAME COMO DICCIONARIO<h3>

In [38]:
#EL DATA FRAME SE LLAMARÁ DICCIONARIO_1


DICCIONARIO_1= {'Name':['Ilche', 'ilche', 'Luis', 'Janet', 'Monier'],
                'Years':  ['10',     '11',    '12',   '17',     '20'],
            'Last Name':[ 'LastName-0','LastName-1','LastName-2','LastName-3','LastName-4']}

variable_frame =pd.DataFrame(DICCIONARIO_1)
variable_frame.head()

     Name Years   Last Name
0   Ilche    10  LastName-0
1   ilche    11  LastName-1
2    Luis    12  LastName-2
3   Janet    17  LastName-3
4  Monier    20  LastName-4

In [39]:
#Accediendo a columnas específicas

variable_frame[0:4]

    Name Years   Last Name
0  Ilche    10  LastName-0
1  ilche    11  LastName-1
2   Luis    12  LastName-2
3  Janet    17  LastName-3